{
  "text": "Pamudu Ranasinghe\npamuduranasinghe9@gmail.com\nLinkedIn |GitHub |YouTube |Google Scholar\nSummary\nI am a Lead AI Engineer with expertise in Natural Language Processing, Computer Vision, Audio Signal Analysis,\nand Embedded Machine Learning. I hold a bachelor’s degree in Electrical and Electronics Engineering, and I am\ncurrently pursuing a Master’s in Data Science and AI. I have more than four years of experience in building\nmachine learning solutions, and my work supports millions of users across different products. My career includes\nindustry projects and research projects that helped me gain international recognition. These experiences have\nshaped me into a versatile and accomplished AI professional.\nTechnical Skills\nLanguages : Python, C++, Matlab, Java, C\nDeveloper Tools : Git, Docker, AWS, GCP, DVC, Neptune.ai, Jenkins, MVTec Halcon\nFrameworks : LangChain, LangGraph, CrewAI, Stable-Baselines3, PyTorch, TensorFlow, Scikit-learn, OpenCV, Docling\nLibraries : Hugging Face, Scikit-learn, MediaPipe, Timm, Ragas\nExperience\nLead AI Engineer Aug 2025 - Present\nCreditSource AUS\n•Lead the AI team at CreditSource, delivering machine-learning solutions for the financial domain.\nSoftware Engineer (AI/ML) July 2024 - Aug 2025\nContractor for UnitedHealth Group via Virtusa USA\n•Worked on developing Advocate Assist, a system that processes 10M+ daily interactions.\n•Built a document extraction system that parses complex tables and text into structured outputs optimized for RAG,\nleading to a patent submission.\n•Initiated and led the development of an MCP server that unified multiple services into a reusable platform with\nauthentication, deployment, and modular design.\n•Designed metric-driven frameworks and agentic workflows to evaluate RAG-based answers.\n•Used LLMs as judges and advanced NLP techniques to assess response quality and relevance.\n•Aligned model-based evaluations with human review, significantly reducing manual effort on complex healthcare\nqueries.\n•Automated the evaluation pipeline with Jenkins and GitHub Actions for continuous regression testing and iterative\nimprovement.\n•Developed a holistic agentic evaluation workflow to measure multiple RAG metrics and deliver concise, actionable\ninsights.\n•Managed and deployed a microservices architecture on GCP using Terraform and Docker.\n•Built an agentic system for dynamic information extraction from complex conversational transcripts.\n•Created a proof of concept to query, retrieve, and visualize data from GCP BigQuery using natural language queries.\nFreelance Consultant - AI R&D Engineer June 2024 - Jan 2025\nvcLABs (Dialog TV) Sri Lanka\n•Fine-tuned and deployed Llama 3.1 70B model for internal Dialog use.\n•Forecasted the viewership of different channels for each timeslot for ad scheduling.\n•Mathematically modelled an advertisement scheduling system to optimize costs and maximize viewership for the\ngiven budget, targeting different age groups, districts, and genres.\n•Developed a scheduling extraction system from various formats, optimizing operational efficiency and reducing staffing\nneeds from six personnel to one.\nConsultant AI Engineer March 2023 - June 2024\nPekoeAI Singapore\n- Access Service Letter -\n•Acquired proficiency in the full Automatic Speech Recognition (ASR) pipeline, audio data annotation, model devel-\nopment, noise reduction, and optimization. Successfully deployed an optimized model on a Jetson Nano for real-time\napplication.\n•Created a computer interface for a mechanical system setup, integrating industrial cameras, deep learning models,\nmulti-threaded processing, and GUIs.\n•Developed a highly accurate Optical Character Recognition (OCR) method and a tracking algorithm for rapidly\nmoving tea sample boxes on a conveyor belt, significantly enhancing processing accuracy.\n•Researched solutions with Generative AI to generate realistic tea samples with user feedback and completed a proof-\nof-concept implementation.\n•Innovated an LLM-based approach to automating the assistant’s task of tea-grading.\n•Focused on semi-supervised learning, contrastive learning, traditional computer vision algorithms, and state-of-the-\nart deep learning models for the accurate identification of matching tea samples.\nFreelance Software & AI Developer Nov 2020 - Feb 2023\nUpwork, Fiverr\n•More than 2 years of experience as a freelance programmer, working with global clients and reputed companies.\n•Developed a surveillance system with 14 cameras to monitor the interaction of humans with machines in an industrial\nworkshop.\n•Implemented a thief detection system for supermarkets using action recognition techniques.\n•Built an application to detect malicious websites.\n•Created a dashboard to monitor a memory game for psychology research, using OCR techniques.\n•Enhanced the performance of wind turbine power prediction through the utilization of hyper-parameter tuning and\nautomated machine learning (AutoML) techniques.\n•Developed a GUI based machine learning application for mental health assessment.\nIntern Machine Learning and AI Engineer Oct 2022 - Jan 2023\nAizenit Technologies London, UK\n•Fine-tuned LayoutLM and Donut transformer models for document information extraction.\n•Developed nowel and robust deep learning-based model architecture for table extraction from invoices.\n•Implemented optimization techniques to minimize latency and improve overall model performance.\n•Proficient with Azure Machine Learning Studio.\nIntern Computer Vision and AI Engineer Aug 2022 - Oct 2022\nAnsell Lanka (Pvt) Ltd Biyagama, Sri Lanka\n•Applied various machine learning and deep learning algorithms, including YOLOv5, Convolutional Neural Networks\n(CNN), Autoencoders, DBSCAN, and Support Vector Machines (SVM).\n•Worked on designing a cloud-based machine learning pipeline for efficient data processing and analysis.\n•Gained hands-on experience with industrial vision cameras, light controllers and laser profiling tools.\n•Leveraged industrial machine vision software for advanced image processing tasks.\n•Specialized in 3D data processing and recreation of 3D objects using sensor data.\nIntern Electrical and Electronic Engineer Nov 2019 - Jan 2020\nDialog Axiata PLC Colombo, Sri Lanka\n•Learned modulation techniques used in wireless communication.\n•Experienced 5G implementation in Colombo area.\nProjects\nDeep Learning based Audio Signal Enhancement and Pattern Recognition (Paper Link) |Pytorch, Neptune.ai\n•Introduced a novel deep learning-based neural network architecture named Y-Net, achieving end-to-end hybrid music\nsource separation by extracting features from both spectrogram and waveform domains.\n•Awarded the Best Final Year Project at the Department of Electronic and Electrical Engineering, University of\nPeradeniya\nLow Light Image Enhancement for Autonomous Driving (GitHub Link) |TensorFlow, U-NET, Jetson Nano\n•Developed novel and high-performing model architectures to address the real-world challenge of low-light image\nenhancement. Achieved state-of-the-art performance, surpassing other models in terms of SSIM value.\nAI approach for FRA test in Transformers (Project Link) |MATLAB, K-means, PCA\n•Proposed a solution to analyze Frequency Response Analysis (FRA) results independently of experience-based ex-\npertise, winding arrangement, number of phases, and MVA rating of the power transformer.\nAI Goalkeeper (Project Link) |OpenCV, YOLOv7, YOLOv7-pose, LSTM, Action Detection, Roboflow\n•Used a combination of time series prediction, object detection, object tracking and pose estimation algorithms for\nPredict the final placement of the ball in penalty kicks.\n•Recognized as one of the most creative projects of 2022 by OpenCV community with over 5M+ impressions, 16,000+\nreactions, and 600+ professional reshares on LinkedIn.\nIoT Monitoring System for Nursing Homes |Signal Processing, Anomaly Detection, One-Class SVM, Random Forest\n•Our solution uses ESP32 microcontrollers to monitor seniors’ pamper wetness levels, triggering alarms for timely\nassistance.\n•Collaborative project with 40 machine learning engineers representing 21 different countries.\n2022 FIFA World Cup Predictor (GitHub Link) |Data Analysis, Machine Learning, Multi-class Classification, Sklearn\n•Correctly predicted three out of four teams that made it to the semifinals and the top three teams overall.\n•Made accurate predictions in crucial matches, including the match between Brazil and Croatia.\nProject ISORT (Project Link) |TensorFlow, CNN, Raspberry Pi\n•A plastic sorting and shredding machine to overcome practical problems in recycling.\n•This project won the second place in the IESL Undergraduate Inventor of the Year 2021 competition.\nEducation\nUniversity of Moratuwa Moratuwa, Sri Lanka\nMSc in Data Science & AI - Computer Science & Engineering 2025 - 2026\nUniversity of Peradeniya Peradeniya, Sri Lanka\nBachelor of the Science of Engineering (Hons.) - Electrical & Electronic Engineering 2017 - 2023\nDharmasoka College Ambalangoda, Sri Lanka\nPrimary and Secondary Education 2003 - 2016\nPublications\nHybrid Y-Net Architecture for Singing Voice Separation (Paper Link)\n2023 31st European Signal Processing Conference\nDeep Learning Based Low Light Enhancements for Advanced Driver-Assistance Systems (Paper Link)\n2023 IEEE 17th International Conference on Industrial and Information Systems\nAI Approach for FRA Based Condition Assessment of Power Transformers (Paper Link)\n2023 IEEE 17th International Conference on Industrial and Information Systems\nChessEye: An Integrated Framework for Accurate and Efficient Chessboard Reconstruction (Paper Link)\n2023 9th Moratuwa Engineering Research Conference (MERCon)\nCertifications\nTraining Program on Artificial Intelligence in Embedded Systems - University of Moratuwa\nOracle Certified Java Program - Sri Lanka Institute of Information Technology (SLIIT)\nAWS Academy Graduate - AWS Academy Data Engineering\nDeepLearning.AI - Neural Networks and Deep Learning (Specialization)\nDeepLearning.AI - Natural Language Processing (Specialization)\nDeepLearning.AI - Generative Adversarial Networks (Specialization)\nDeepLearning.AI - Generative AI with Large Language Models\nStanford University - Machine Learning\nAchievements\nInter University Chess Championship - Second Place 2021\nAsian University Chess Championship - 8th Place (Team Sri Lanka) 2021\nIEEE Electronic Design Competition - Second Place 2020\nUniversity Colors 2021, 2022\nSouthern Province Colors 2014, 2015\nSchool Colors 2010, 2011, 2012, 2013, 2014, 2015\nExtracurricular Activities\nChess Team Vice Captain of University of Peradeniya 2021 - 2022\nProgramming Team Lead at Taprobane 2.0 project by SEDS Sri Lanka 2021 - 2022\nSystem Programmer at IEEE Microwave Theory & Techniques Society 2020 - 2021\nAIESEC in Kandy 2018 - 2019\nInterests\nProblem-Solving, Explore New Technology, Graphic Designing, Playing Chess\nNon Related Referees\nProf. Maheshi Dissanayake\nProfessor\nDepartment of Electrical and Electronic Engineering\nFaculty of Engineering\nUniversity of Peradeniya, Sri Lanka\nPhone: +94 (0)81 239 3437 (SL)\nEmail: maheshid@eng.pdn.ac.lkProf. Manjula Fernando\nProfessor\nDepartment of Electrical and Electronic Engineering\nFaculty of Engineering\nUniversity of Peradeniya, Sri Lanka\nPhone: +94 (0)81 239 3424 (SL)\nEmail: manjula@ee.pdn.ac.lk\n"
}